In [3]:
import numpy as np
data=[4,4,6,8,10]

mean=np.mean(data)#Average
print("Mean:",mean)

Mean: 6.4

In [14]:
median=np.median(data)#median
print("Median:",median)

Median: 6.0

In [26]:
from scipy import stats
mode=stats.mode(data)#Repeat
print("Mode:",mode)

Mode: ModeResult(mode=4, count=2)

In [18]:
range=np.max(data)-np.min(data)#range
print("Range:",range)

Range: 6

In [3]:
import pandas as pd
data=[{'a':1,'b':2},{'a':2,'b':-4,'c':8}]
table1=pd.DataFrame(data)
print(table1)
table1.corr()

   a  b    c
0  1  2  NaN
1  2 -4  8.0

     a    b   c
a  1.0 -1.0 NaN
b -1.0  1.0 NaN
c  NaN  NaN NaN

In [7]:
table1.std()

a    0.707107
b    4.242641
c         NaN
dtype: float64

In [5]:
table1.var()

a     0.5
b    18.0
c     NaN
dtype: float64

In [11]:
table1.cov()

     a     b   c
a  0.5  -3.0 NaN
b -3.0  18.0 NaN
c  NaN   NaN NaN

In [45]:
#create dataframe in pandas
data={'Name':['A','B','C','d','e','g'],'Age':[20,50,30,40,35,55],'City':['Mumbai','Hydrabad','Delhi','Kerala','Delhi','Mumbai']}
df=pd.DataFrame(data)
print("DataFrame:\n",df)
print("Summary statistic:",df.describe())

DataFrame:
   Name  Age      City
0    A   20    Mumbai
1    B   50  Hydrabad
2    C   30     Delhi
3    d   40    Kerala
4    e   35     Delhi
5    g   55    Mumbai
Summary statistic:              Age
count   6.000000
mean   38.333333
std    12.909944
min    20.000000
25%    31.250000
50%    37.500000
75%    47.500000
max    55.000000

In [47]:
#adding new column
df['salary']=[50000,60000,40000,60000,55000,45000]
print(df)

  Name  Age      City  salary
0    A   20    Mumbai   50000
1    B   50  Hydrabad   60000
2    C   30     Delhi   40000
3    d   40    Kerala   60000
4    e   35     Delhi   55000
5    g   55    Mumbai   45000

In [49]:
#Accessing columns
ages=df['Age']
print(ages)

0    20
1    50
2    30
3    40
4    35
5    55
Name: Age, dtype: int64

In [51]:
#Filtering data
Age=df[df['Age']>30]
print(Age)

  Name  Age      City  salary
1    B   50  Hydrabad   60000
3    d   40    Kerala   60000
4    e   35     Delhi   55000
5    g   55    Mumbai   45000

In [53]:
#Group by and Aggregation
mean_age_by_city=df.groupby('City')['Age'].mean()
print(mean_age_by_city)

City
Delhi       32.5
Hydrabad    50.0
Kerala      40.0
Mumbai      37.5
Name: Age, dtype: float64

In [7]:
#array operation
arr=np.array([1,2,3,4])
add=arr+10
mult=arr*2
sum=np.sum(arr)
mean=np.mean(arr)
std=np.std(arr)

print(add)
print(mult)
print(sum)
print(mean)
print(std)

[11 12 13 14]
[2 4 6 8]
10
2.5
1.118033988749895

In [ ]:
#Normsl Distribution(Employee salary)
axis[0,0]